'''
循环逻辑基础
'''

'''
while循环基本流程
1. 初始化计数器
2. while 循环条件判断:
        循环体
        更新计数器
        
总结分三步走:
1. 初始化计数器
2. 写循环判断
3. 更新计数器
'''
'''
需求： 通过while循环打印5次python真有趣
'''
# 初始化计数器
num = 0
while num < 5:
    print('python 真有趣')
    num += 1

'''
需求：
使用while循环，计算1到50的数字累加值和
思路:
1. 初始化计数器num = 1
2. 编写while循环，只要num <= 50， 就执行循环体逻辑
3. 在循环内部更新num += 1
'''
# 初始化计数器num=1
num = 1
# 用来计算累计求和
sum = 0
# 循环，只要num <= 50就执行循环体
while num <= 50:
    # print(num)
    sum = sum + num
    # 更新计数器
    num += 1
print(f'从1到50的数字累计求和为{sum}')
'''
需求：
计算从1到50的所有奇数的和
思路:
1. 初始化计数器num = 1,表示每次循环使用的数字，定义sum变量，用来计算累加的和
2. 编写while条件，while num <= 50:进行循环
3. 在循环体中进行判断，如果为奇数，则累加求和
'''
# 初始化计数器num = 1
num = 1
# 用来计算累计求和
sum = 0
# 循环，只要num <= 50就执行循环体
while num <= 50:
    # 判断为奇数才打印
    if num % 2 != 0:
        # print(num)
        sum = sum + num
    num += 1
print(f'从1到50的数字中，对奇数累计求和的结果为{sum}')
